Changweibin/TEST/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33ld5xx.h
/**
  ****************************************************************************************************//**
  * @file     FM33LD5XX.h
  *
  * @brief    Starmc1 Peripheral Access Layer Header File for
  *           FM33LD5XX from Keil.
  *
  * @version  V1.0
  * @date     17. February 2025
  *******************************************************************************************************
  * @attention    
  * @attention
  * Copyright 2025 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  *******************************************************************************************************
  */

/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33LD5XX
  * @{
  */

#ifndef FM33LD5XX_H
#define FM33LD5XX_H

#ifdef __cplusplus
extern "C" {
#endif

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;
typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunState;
typedef enum {FAIL = 0, PASS = !FAIL} ErrorStatus;

#define __RCHF_INITIAL_CLOCK        (16000000)        /* Value of the Internal RC HIGH oscillator in Hz */
#define __RCLP_CLOCK                (32768)           /* Value of the Internal RC LOW oscillator in Hz */
#define __XTHF_CLOCK                (8000000)         /* Value of the EXTERNAL oscillator in Hz */


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum
{

    /* -------------------  FM33LD5XX Processor Exceptions Numbers  -------------------*/
	  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset           */
    NMI_IRQn                      = -14,              /*!<   2  不可屏蔽中断 */
    Hardfault_IRQn                = -13,              /*!<   3  处理器内部错误 */
    MemManage_IRQn                = -12,              /*!<   4  MPU错误 */
    BusFault_IRQn                 = -11,              /*!<   5  总线错误 */
    UsageFault_IRQn               = -10,              /*!<   6  指令执行错误 */
    SVCall_IRQn                   = -5,               /*!<  11  SupervisorCall */
    DebugMonitor_IRQn             = -4,               /*!<  11  DebugMonitor */
    PendSV_IRQn                   = -2,               /*!<  14  系统服务请求 */
    SysTick_IRQn                  = -1,               /*!<  15  内核定时器中断 */

    /* --------------------  Cortex-M33 Specific Interrupt Numbers  --------------------*/
    WWDT_IRQn                     = 0,                /*!<   0  WWDT */
    SVD_IRQn                      = 1,                /*!<   1  SVD  */
    IWDT_IRQn                     = 3,                /*!<   3  IWDT */
    FLASH_IRQn                    = 4,                /*!<   4  FLASH */
    CMU_IRQn                      = 5,                /*!<   5  CMU */
    MAP_ERR_IRQn                  = 7,                /*!<   7  MAP_ERR */
    ADC0_IRQn                     = 8,                /*!<   8  ADC0 */
    ADC1_IRQn                     = 9,                /*!<   9  ADC1 */
    DAC0_IRQn                     = 10,               /*!<  10  DAC0 */
    SPI0_IRQn                     = 11,               /*!<  11  SPI0 */
    SPI1_IRQn                     = 12,               /*!<  12  SPI1 */
    SPI2_IRQn                     = 13,               /*!<  13  SPI2 */
    DAC1_IRQn                     = 16,               /*!<  16  DAC1 */
    QSPI_IRQn                     = 17,               /*!<  17  QSPI */
    UART0_IRQn                    = 18,               /*!<  18  UART0 */
    UART1_IRQn                    = 19,               /*!<  19  UART1 */
    UART2_IRQn                    = 20,               /*!<  20  UART2 */
    UART3_IRQn                    = 21,               /*!<  21  UART3 */
    UART4_IRQn                    = 22,               /*!<  22  UART4 */
    UART5_IRQn                    = 23,               /*!<  23  UART5 */
    ADC2_IRQn                     = 24,               /*!<  24  ADC2 */
    ADC3_IRQn                     = 25,               /*!<  25  ADC3 */
    EXTIA_IRQn                    = 26,               /*!<  26  GPIOA */
    EXTIB_IRQn                    = 27,               /*!<  27  GPIOB */
    EXTIC_IRQn                    = 28,               /*!<  28  GPIOC */
    EXTID_IRQn                    = 29,               /*!<  29  GPIOD */
    EXTIE_IRQn                    = 30,               /*!<  30  GPIOE */
    EXTIF_IRQn                    = 31,               /*!<  31  GPIOF */
    EXTIG_IRQn                    = 32,               /*!<  32  GPIOG */
    PMU_IRQn                      = 37,               /*!<  37  PMU */
    I2C0_IRQn                     = 38,               /*!<  38  I2C0 */
    I2C1_IRQn                     = 39,               /*!<  39  I2C1 */
    CLM0_IRQn                     = 43,               /*!<  43  CLM0 */
    CLM1_IRQn                     = 44,               /*!<  44  CLM1 */
    CLM2_IRQn                     = 45,               /*!<  45  CLM2 */
    FPU_IRQn                      = 48,               /*!<  48  FPU */
    DMA_IRQn                      = 50,               /*!<  50  DMA */
    WKUPx_IRQn                    = 51,               /*!<  51  WKUP */
    PGL_IRQn                      = 52,               /*!<  52  PGL */
    COMPx_IRQn                    = 53,               /*!<  53  COMP */
    CANFD0_IRQn                   = 56,               /*!<  56  CANFD0 */
    LPTIM16_IRQn                  = 60,               /*!<  60  LPTIM16 */
    BSTIM16_IRQn                  = 62,               /*!<  62  BSTIM16 */
    ATIM0_IRQn                    = 64,               /*!<  64  ATIM0 */
    ATIM1_IRQn                    = 65,               /*!<  65  ATIM1 */
    ATIM2_IRQn                    = 66,               /*!<  66  ATIM2 */
    GPTIM0_IRQn                   = 68,               /*!<  68  GPTIM0 */
    GPTIM1_IRQn                   = 69,               /*!<  69  GPTIM1 */
    GPTIM5_IRQn                   = 71,               /*!<  71  GPTIM5 */
    TAU0_IRQn                     = 73,               /*!<  73  TAU0 */
    CORDIC_IRQn                   = 76,               /*!<  76  CORDIC */
} IRQn_Type;

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ------ */
#define __SAUREGION_PRESENT       0U        /* SAU regions present */
#define __MPU_PRESENT             1U        /* MPU present */
#define __VTOR_PRESENT            1U        /* VTOR present */
#define __NVIC_PRIO_BITS          3U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /* FPU present */
#define __DSP_PRESENT             1U        /* DSP extension present */
#define __ICACHE_PRESENT          1U        /* Define if an ICACHE is present or not */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_starmc1.h"                   /*!< Star-MC1 processor and core peripherals */
#include "system_fm33ld5xx.h"               /*!< FM33LD5XX System */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */

/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
#pragma warning 586
#else
#warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================                       FLS                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t RDCR;                    /*!<  FlashReadControlRegister,                             Address offset: 0x00 */
    __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
    __IO uint32_t EPCR;                   /*!<  FlashErase/ProgramControlRegister,                    Address offset: 0x14 */
    __O  uint32_t KEY;                    /*!<  FlashKeyRegister,                                     Address offset: 0x18 */
    __IO uint32_t IER;                    /*!<  FlashInterruptEnableRegister,                         Address offset: 0x1C */
    __IO uint32_t ISR;	                  /*!<  FlashInterruptStatusRegister,                         Address offset: 0x20 */
    __IO uint32_t RSV2;	                  /*!<  FlashInterruptStatusRegister,                         Address offset: 0x24 */ 
	  __IO uint32_t CECCSR;	                /*!<  Flash Code ECC Status Register,                       Address offset: 0x28 */
	  __IO uint32_t DECCSR;	                /*!<  Flash Data ECC Status Register,                       Address offset: 0x2C */
	  __IO uint32_t RSV3[2];	                /*!<  FlashInterruptStatusRegister,                         Address offset: 0x30 */
	  __IO uint32_t ECCCR;	                /*!<  Flash ECC tControl Register,                          Address offset: 0x38 */ 
	  
