Changweibin/TEST/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33ld5xx.h
} FLASH_Type;

/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR;                     /*!<  PowerManagementControlRegister,                       Address offset: 0x00 */
    __IO uint32_t WKTR;                   /*!<  WakeupTimeRegister,                                   Address offset: 0x04 */
    __IO uint32_t WKFR0;                  /*!<  WakeupSourceFlagsRegister1,                           Address offset: 0x08 */
    __IO uint32_t WKFR1;                  /*!<  WakeupSourceFlagsRegister2,                           Address offset: 0x0C */
    __IO uint32_t IER;                    /*!<  IER REGISTER,                                         Address offset: 0x10 */
    __IO uint32_t ISR;                    /*!<  ISR REGISTER,                                         Address offset: 0x14 */
    __IO uint32_t RAMCR;                  /*!<  RAM CONTROL REGISTER,                                 Address offset: 0x18 */
    __IO uint32_t RSV[8];                 /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
    __IO uint32_t BUFCR;                  /*!<  BUFFER CONTROL REGISTER,                              Address offset: 0x3C */
    __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x40 */
    __IO uint32_t PTATCR;                 /*!<  PAPTControlRegister,                                  Address offset: 0x50 */
    __IO uint32_t AUXEN;                  /*!<  AUXControlRegister,                                   Address offset: 0x54 */
} PMU_Type;

/* ================================================================================ */
/* ================                       CLM                      ================ */
/* ================================================================================ */
typedef struct
{
    __IO uint32_t CR;                     /*!< Address offset: 0x00  */
    __IO uint32_t CFGR;                   /*!< Address offset: 0x04  */
    __IO uint32_t CNT;                    /*!< Address offset: 0x08  */
    __IO uint32_t ISR;                    /*!< Address offset: 0x0C  */
    __IO uint32_t CMPH;                   /*!< Address offset: 0x10  */
    __IO uint32_t CMPL;                   /*!< Address offset: 0x14  */
	__IO uint32_t TOCFGR;                 /*!< Address offset: 0x18  */
} CLM_Type;

/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t PDRCR;                    /*!<  PDR Control Register,                                Address offset: 0x00 */
    __IO uint32_t RSV;                      /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
    __IO uint32_t RSTCR;                    /*!<  ResetConfigRegister,                                  Address offset: 0x08 */
    __O  uint32_t SOFTRST;                  /*!<  SoftwareResetRegister,                                Address offset: 0x0C */
    __IO uint32_t RSTFR;                    /*!<  ResetFlagRegister,                                    Address offset: 0x10 */
    __O  uint32_t PRSTEN;                   /*!<  PeripheralResetEnableRegister,                        Address offset: 0x14 */
    __IO uint32_t AHBRSTCR;                 /*!<  AHBPeripheralsResetRegister,                          Address offset: 0x18 */
    __IO uint32_t APBRSTCR1;                /*!<  APBPeripheralsResetRegister1,                         Address offset: 0x1C */
    __IO uint32_t APBRSTCR2;                /*!<  APBPeripheralsResetRegister2,                         Address offset: 0x20 */
} RMU_Type;

/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */

typedef struct
{
    __O  uint32_t SERV;                   /*!<  IWDTServiceRegister,                                  Address offset: 0x00 */
    __IO uint32_t CR;                     /*!<  IWDTConfigRegister,                                   Address offset: 0x04 */
    __I  uint32_t CNT;                    /*!<  IWDTCounterRegister,                                  Address offset: 0x08 */
    __IO uint32_t WIN;                    /*!<  IWDTWindowRegister,                                   Address offset: 0x0C */
    __IO uint32_t IER;                    /*!<  IWDTInterruptEnableRegister,                          Address offset: 0x10 */
    __IO uint32_t ISR;                    /*!<  IWDTInterruptStatusRegister,                          Address offset: 0x14 */
} IWDT_Type;

/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */

typedef struct
{
    __O  uint32_t CR;                     /*!<  WWDTControlRegister,                                  Address offset: 0x00 */
    __IO uint32_t CFGR;                   /*!<  WWDTConfigRegister,                                   Address offset: 0x04 */
    __I  uint32_t CNT;                    /*!<  WWDTCounterRegister,                                  Address offset: 0x08 */
    __IO uint32_t IER;                    /*!<  WWDTInterruptEnableRegister,                          Address offset: 0x0C */
    __IO uint32_t ISR;                    /*!<  WWDTInterruptStatusRegister,                          Address offset: 0x10 */
    __I  uint32_t PSC;                    /*!<  WWDTPrescalerRegister,                                Address offset: 0x14 */
} WWDT_Type;

/* ================================================================================ */
/* ================                       CMU                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t SYSCLKCR;               /*!<  SystemClockControlRegister,                           Address offset: 0x00 */
    __IO uint32_t RCHFCR;                 /*!<  RCHFControlRegister,                                  Address offset: 0x04 */
    __IO uint32_t RCHFTR;                 /*!<  RCHFTrimRegister,                                     Address offset: 0x08 */
    __IO uint32_t PLLCR;                  /*!<  PLLControlRegister,                                   Address offset: 0x0C */
    __IO uint32_t RCLPCR;                 /*!<  RCLPControlRegister,                                  Address offset: 0x10 */
    __IO uint32_t RCLPTR;                 /*!<  RCLPTrimRegister,                                     Address offset: 0x14 */
    __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
    __IO uint32_t XTHFCR;                 /*!<  XTHFControlRegister,                                  Address offset: 0x20 */
    __IO uint32_t RSV2[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
    __IO uint32_t IER;                    /*!<  InterruptEnableRegister,                              Address offset: 0x2C */
    __IO uint32_t ISR;                    /*!<  InterruptStatusRegister,                              Address offset: 0x30 */
    __IO uint32_t PCLKCR1;                /*!<  PeripheralbusClockControlRegister1,                   Address offset: 0x34 */
    __IO uint32_t PCLKCR2;                /*!<  PeripheralbusClockControlRegister2,                   Address offset: 0x38 */
    __IO uint32_t PCLKCR3;                /*!<  PeripheralbusClockControlRegister3,                   Address offset: 0x3C */
    __IO uint32_t PCLKCR4;                /*!<  PeripheralbusClockControlRegister4,                   Address offset: 0x40 */
    __IO uint32_t OPCCR1;                 /*!<  PeripheralClockConfigRegister1,                       Address offset: 0x44 */
    __IO uint32_t RSV3;                   /*!<  PeripheralClockConfigRegister2,                       Address offset: 0x48 */
    __IO uint32_t OPCER1;                 /*!<  PeripheralClockEnableRegister1,                       Address offset: 0x4C */
    __IO uint32_t AMCR;                   /*!<  AHB Master Control Register ,                         Address offset: 0x50 */
    __IO uint32_t RSV4;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
    __IO uint32_t RCHF16CR;               /*!<  RCHF16CR Register,                                    Address offset: 0x58 */
    __IO uint32_t RSV5[9];                /*!<  ClockCalibrationConfigRegister,                       Address offset: 0x5C */
    __IO  uint32_t CFDCR;                  /*!<  CFDCR Register,                                       Address offset: 0x80 */
    __IO uint32_t CFDER;                  /*!<  CFDER Register,                                       Address offset: 0x84 */
} CMU_Type;

/* ================================================================================ */
/* ================                       CORDIC                      ================ */
/* ================================================================================ */
typedef struct
{
    __IO uint32_t INA;               /*!< Address offset: 0x00 */
    __IO uint32_t INB;               /*!< Address offset: 0x04 */
    __IO uint32_t CR;                /*!< Address offset: 0x08 */
    __IO uint32_t OUT;               /*!< Address offset: 0x0C */
    __IO uint32_t ISR;               /*!< Address offset: 0x10 */
    __IO uint32_t IER;               /*!< Address offset: 0x14 */
} CORDIC_Type;

/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CFGR;                   /*!<  SVDConfigRegister,                                    Address offset: 0x00 */
    __IO uint32_t CR;                     /*!<  SVDControlRegister,                                   Address offset: 0x04 */
    __IO uint32_t IER;                    /*!<  SVDInterruptEnableRegister,                           Address offset: 0x08 */
    __IO uint32_t ISR;                    /*!<  SVDInterruptStatusRegister,                           Address offset: 0x0C */
    __IO uint32_t VSR;                    /*!<  SVDreferenceVoltageSelectRegister,                    Address offset: 0x10 */
} SVD_Type;

/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR;                     /*!< ComparatorControl Register 1,                        Address offset: 0x00 */

} COMP_Type;

typedef struct
{
    __IO uint32_t ICR;                    /*!< Comparator Interrupt Config Register,                Address offset: 0x00 */
    __IO uint32_t ISR;                    /*!< Comparator Interrupt Status Register,                Address offset: 0x04 */
    __IO uint32_t RSV0;                   /*!< RESERVED REGISTER0,                                  Address offset: 0x08 */
    __IO uint32_t BUFCR;                  /*!< Comparator Interrupt Status Register,                Address offset: 0x0C */
} COMP_COMMON_Type;

/* ================================================================================ */
/* ================                      I2Cx                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t MSPCFGR;                /*!<  I2CMasterConfigRegister,                              Address offset: 0x00 */
    __IO uint32_t MSPCR;                  /*!<  I2CMasterControlRegister,                             Address offset: 0x04 */
    __IO uint32_t MSPIER;                 /*!<  I2CMasterIntteruptEnableRegister,                     Address offset: 0x08 */
    __IO uint32_t MSPISR;                 /*!<  I2CMasterInterruptStatusRegister,                     Address offset: 0x0C */
    __IO uint32_t MSPSR;                  /*!<  I2CMasterStatusRegister,                              Address offset: 0x10 */
    __IO uint32_t MSPBGR;                 /*!<  I2CMasterBaudrateGeneratorRegister,                   Address offset: 0x14 */
    __IO uint32_t MSPBUF;                 /*!<  I2CMastertransferBuffer,                              Address offset: 0x18 */
    __IO uint32_t MSPTCR;                 /*!<  I2CMasterTimingControlRegister,                       Address offset: 0x1C */
    __IO uint32_t MSPTOR;                 /*!<  I2CMasterTime-OutRegister,                            Address offset: 0x20 */
} I2C_Type;

/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t IRCR;                   /*!<  InfraredmodulationControlRegister,                    Address offset: 0x00 */
} UART_COMMON_Type;

/* ================================================================================ */
/* ================                      UARTx                     ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CSR;                    /*!<  UARTxControlStatusRegister,                           Address offset: 0x00 */
    __IO uint32_t IER;                    /*!<  UARTxInterruptEnableRegister,                         Address offset: 0x04 */
    __IO uint32_t ISR;                    /*!<  UARTxInterruptStatusRegister,                         Address offset: 0x08 */
    __IO uint32_t TODR;                   /*!<  UARTxTime-OutandDelayRegister,                        Address offset: 0x0C */
    __I  uint32_t RXBUF;                  /*!<  UARTxReceiveBuffer,                                   Address offset: 0x10 */
    __O  uint32_t TXBUF;                  /*!<  UARTxTransmitBuffer,                                  Address offset: 0x14 */
    __IO uint32_t BGR;                    /*!<  UARTxBaudrateGeneratorRegister,                       Address offset: 0x18 */
    __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
    __IO uint32_t MCR;                    /*!<  UARTxModeControlRegister,                             Address offset: 0x20 */
    __IO uint32_t LINCR;                  /*!<  UARTxLINControlRegister,                              Address offset: 0x24 */
    __I  uint32_t LINBSR;                 /*!<  UARTxLINBaudSyncRegister,                             Address offset: 0x28 */
    __IO uint32_t LINFTR;                 /*!<  UARTxLINFrameTimeoutRegister,                         Address offset: 0x2C */
    __IO uint32_t LINTTR;                 /*!<  UARTxLINTransmitTimingRegister,                       Address offset: 0x30 */
    __I  uint32_t LINPSR;                 /*!<  UARTLINPre-syncbaudregister,                          Address offset: 0x34 */
    __IO uint32_t LINBKR;                 /*!<  ,                                                     Address offset: 0x38 */
    __IO uint32_t RSV2;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x3C */
    __IO uint32_t SCISR;                  /*!<  UARTxSmartCardInterruptStatusRegister,                Address offset: 0x40 */
    __IO uint32_t SCIER;                  /*!<  UARTxSmartCardInterruptEnableRegister,                Address offset: 0x44 */
    __IO uint32_t FFCR;                   /*!<  UARTxSmartCardFrameFormatControlRegister,             Address offset: 0x48 */
    __IO uint32_t EGTR;                   /*!<  UARTxSmartCardExtraGuardTimeRegister,                 Address offset: 0x4C */
    __IO uint32_t CODR;                   /*!<  UARTxSmartCardClockOutputRegister,                    Address offset: 0x50 */
    __IO uint32_t RSV3[11];               /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
    __IO uint32_t LINSCCR;                /*!<  LINSelf-testCwitchControlRegister,                    Address offset: 0x80 */
} UART_Type;

/* ================================================================================ */
/* ================                      SPIx                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR1;                    /*!<  SPIxControlRegister1,                                 Address offset: 0x00 */
    __IO uint32_t CR2;                    /*!<  SPIxControlRegister2,                                 Address offset: 0x04 */
    __IO uint32_t CR3;                    /*!<  ControlRegister3,                                     Address offset: 0x08 */
    __IO uint32_t IER;                    /*!<  SPIxInterruptEnableRegister,                          Address offset: 0x0C */
    __IO uint32_t ISR;                    /*!<  SPIxStatusRegister,                                   Address offset: 0x10 */
    __O  uint32_t TXBUF;                  /*!<  SPIxTransmitBuffer,                                   Address offset: 0x14 */
    __I  uint32_t RXBUF;                  /*!<  SPIxReceiveBuffer,                                    Address offset: 0x18 */
    __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
    __IO uint32_t I2SCR;                  /*!<  I2SControlRegister,                                   Address offset: 0x20 */
    __IO uint32_t I2SPR;                  /*!<  SPIxI2SPrescalerRegister,                             Address offset: 0x24 */
} SPI_Type;

/* ================================================================================ */
/* ================                      CANFD                     ================ */
/* ================================================================================ */


/**
  * @brief CANFD module information (CANFD)
  */

