Changweibin/TEST/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33ld5xx.h
typedef struct
{
    __IO uint32_t CH0CR;                  /*!<  Channel0ControlRegister,                              Address offset: 0x00 */
    __IO uint32_t CH0CFGR;                /*!<  Channel0ConfigRegister,                               Address offset: 0x04 */
    __IO uint32_t CH0PAR;                 /*!<  Channel0PeripheralAddressRegister,                    Address offset: 0x08 */
    __IO uint32_t CH0MAR0;                /*!<  Channel0MemoryAddressRegister0,                       Address offset: 0x0C */
    __IO uint32_t CH0MAR1;                /*!<  Channel0MemoryAddressRegister1,                       Address offset: 0x10 */
    __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x14 */
    __IO uint32_t CH1CR;                  /*!<  Channel1ControlRegister,                              Address offset: 0x20 */
    __IO uint32_t CH1CFGR;                /*!<  Channel1ConfigRegister,                               Address offset: 0x24 */
    __IO uint32_t CH1PAR;                 /*!<  Channel1PeripheralAddressRegister,                    Address offset: 0x28 */
    __IO uint32_t CH1MAR0;                /*!<  Channel1MemoryAddressRegister0,                       Address offset: 0x2C */
    __IO uint32_t CH1MAR1;                /*!<  Channel1MemoryAddressRegister1,                       Address offset: 0x30 */
    __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
    __IO uint32_t CH2CR;                  /*!<  Channel2ControlRegister,                              Address offset: 0x40 */
    __IO uint32_t CH2CFGR;                /*!<  Channel2ConfigRegister,                               Address offset: 0x44 */
    __IO uint32_t CH2PAR;                 /*!<  Channel2PeripheralAddressRegister,                    Address offset: 0x48 */
    __IO uint32_t CH2MAR0;                /*!<  Channel2MemoryAddressRegister0,                       Address offset: 0x4C */
    __IO uint32_t CH2MAR1;                /*!<  Channel2MemoryAddressRegister1,                       Address offset: 0x50 */
    __IO uint32_t RSV3[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
    __IO uint32_t CH3CR;                  /*!<  Channel3ControlRegister,                              Address offset: 0x60 */
    __IO uint32_t CH3CFGR;                /*!<  Channel3ConfigRegister,                               Address offset: 0x64 */
    __IO uint32_t CH3PAR;                 /*!<  Channel3PeripheralAddressRegister,                    Address offset: 0x68 */
    __IO uint32_t CH3MAR0;                /*!<  Channel3MemoryAddressRegister0,                       Address offset: 0x6C */
    __IO uint32_t CH3MAR1;                /*!<  Channel3MemoryAddressRegister1,                       Address offset: 0x70 */
    __IO uint32_t RSV4[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x74 */
    __IO uint32_t CH4CR;                  /*!<  Channel4ControlRegister,                              Address offset: 0x80 */
    __IO uint32_t CH4CFGR;                /*!<  Channel4ConfigRegister,                               Address offset: 0x84 */
    __IO uint32_t CH4PAR;                 /*!<  Channel4PeripheralAddressRegister,                    Address offset: 0x88 */
    __IO uint32_t CH4MAR0;                /*!<  Channel4MemoryAddressRegister0,                       Address offset: 0x8C */
    __IO uint32_t CH4MAR1;                /*!<  Channel4MemoryAddressRegister1,                       Address offset: 0x90 */
    __IO uint32_t RSV5[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x94 */
    __IO uint32_t CH5CR;                  /*!<  Channel5ControlRegister,                              Address offset: 0xA0 */
    __IO uint32_t CH5CFGR;                /*!<  Channel5ConfigRegister,                               Address offset: 0xA4 */
    __IO uint32_t CH5PAR;                 /*!<  Channel5PeripheralAddressRegister,                    Address offset: 0xA8 */
    __IO uint32_t CH5MAR0;                /*!<  Channel5MemoryAddressRegister0,                       Address offset: 0xAC */
    __IO uint32_t CH5MAR1;                /*!<  Channel5MemoryAddressRegister1,                       Address offset: 0xB0 */
    __IO uint32_t RSV6[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0xB4 */
    __IO uint32_t CH6CR;                  /*!<  Channel6ControlRegister,                              Address offset: 0xC0 */
    __IO uint32_t CH6CFGR;                /*!<  Channel6ConfigRegister,                               Address offset: 0xC4 */
    __IO uint32_t CH6PAR;                 /*!<  Channel6PeripheralAddressRegister,                    Address offset: 0xC8 */
    __IO uint32_t CH6MAR0;                /*!<  Channel6MemoryAddressRegister0,                       Address offset: 0xCC */
    __IO uint32_t CH6MAR1;                /*!<  Channel6MemoryAddressRegister1,                       Address offset: 0xD0 */
    __IO uint32_t RSV7[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0xD4 */
    __IO uint32_t CH7CR;                  /*!<  Channel7ControlRegister,                              Address offset: 0xE0 */
    __IO uint32_t CH7FAR;                 /*!<  Channel7FlashAddressRegister,                         Address offset: 0xE4 */
    __IO uint32_t CH7RAR;                 /*!<  Channel7RAMAddressRegister,                           Address offset: 0xE8 */
    __IO uint32_t RSV8[69];               /*!<  RESERVED REGISTER,                                    Address offset: 0xEC */
    __IO uint32_t GCR;                    /*!<  DMAGlobalControlRegister,                             Address offset: 0x200 */
    __IO uint32_t SWRR;                   /*!<  DMASoftwareRequestRegister,                           Address offset: 0x204 */
    __IO uint32_t RSV9[62];               /*!<  RESERVED REGISTER,                                    Address offset: 0x208 */
    __IO uint32_t ISR;                    /*!<  DMAInterruptStatusRegister,                           Address offset: 0x300 */
    __I  uint32_t CH0TFSADDR;             /*!<  ,                                                     Address offset: 0x304 */
    __I  uint32_t CH1TFSADDR;             /*!<  ,                                                     Address offset: 0x308 */
    __I  uint32_t CH2TFSADDR;             /*!<  ,                                                     Address offset: 0x30C */
    __I  uint32_t CH3TFSADDR;             /*!<  ,                                                     Address offset: 0x310 */
    __I  uint32_t CH4TFSADDR;             /*!<  ,                                                     Address offset: 0x314 */
    __I  uint32_t CH5TFSADDR;             /*!<  ,                                                     Address offset: 0x318 */
    __I  uint32_t CH6TFSADDR;             /*!<  ,                                                     Address offset: 0x31C */
} DMA_Type;

/* ================================================================================ */
/* ================                       CRC                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t DR;                     /*!<  CRCDataRegister,                                      Address offset: 0x00 */
    __IO uint32_t CR;                     /*!<  CRCControlRegister,                                   Address offset: 0x04 */
    __IO uint32_t LFSR;                   /*!<  CRCLinearFeedbackShiftRegister,                       Address offset: 0x08 */
    __IO uint32_t XOR;                    /*!<  CRCoutputXORRegister,                                 Address offset: 0x0C */
    __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
    __IO uint32_t POLY;                   /*!<  CRCPolynominalRegister,                               Address offset: 0x1C */
} CRC_Type;

/* ================================================================================ */
/* ================                      ATIMx                     ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR1;                    /*!<  ,                                                     Address offset: 0x00 */
    __IO uint32_t CR2;                    /*!<  ,                                                     Address offset: 0x04 */
    __IO uint32_t SMCR;                   /*!<  ,                                                     Address offset: 0x08 */
    __IO uint32_t DIER;                   /*!<  ,                                                     Address offset: 0x0C */
    __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x10 */
    __O  uint32_t EGR;                    /*!<  ,                                                     Address offset: 0x14 */
    __IO uint32_t CCMR1;                  /*!<  ,                                                     Address offset: 0x18 */
    __IO uint32_t CCMR2;                  /*!<  ,                                                     Address offset: 0x1C */
    __IO uint32_t CCER;                   /*!<  ,                                                     Address offset: 0x20 */
    __IO uint32_t CNT;                    /*!<  ,                                                     Address offset: 0x24 */
    __IO uint32_t PSC;                    /*!<  ,                                                     Address offset: 0x28 */
    __IO uint32_t ARR;                    /*!<  ,                                                     Address offset: 0x2C */
    __IO uint32_t RCR;                    /*!<  ,                                                     Address offset: 0x30 */
    __IO uint32_t CCR1;                   /*!<  ,                                                     Address offset: 0x34 */
    __IO uint32_t CCR2;                   /*!<  ,                                                     Address offset: 0x38 */
    __IO uint32_t CCR3;                   /*!<  ,                                                     Address offset: 0x3C */
    __IO uint32_t CCR4;                   /*!<  ,                                                     Address offset: 0x40 */
    __IO uint32_t BDTR;                   /*!<  ,                                                     Address offset: 0x44 */
    __IO uint32_t CCMR3;                  /*!<  ,                                                     Address offset: 0x48 */
    __IO uint32_t CCR5;                   /*!<  ,                                                     Address offset: 0x4C */
    __IO uint32_t CCR6;                   /*!<  ,                                                     Address offset: 0x50 */
    __IO uint32_t ECR;                    /*!<  ,                                                     Address offset: 0x54 */
    __IO uint32_t TISEL;                  /*!<  ,                                                     Address offset: 0x58 */
    __IO uint32_t AFR;                    /*!<  ,                                                     Address offset: 0x5C */
    __IO uint32_t BRKFLAG;                /*!<  ,                                                     Address offset: 0x60 */
    __IO uint32_t RSV1[37];               /*!<  RESERVED REGISTER,                                    Address offset: 0x64 */
    __IO uint32_t DCR;                    /*!<  ,                                                     Address offset: 0xF8 */
    __IO uint32_t DMAR;                   /*!<  ,                                                     Address offset: 0xFC */
} ATIM_Type;

/* ================================================================================ */
/* ================               GPTIMx                           ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR1;                    /*!<  ,                                                     Address offset: 0x00 */
    __IO uint32_t CR2;                    /*!<  ,                                                     Address offset: 0x04 */
    __IO uint32_t SMCR;                   /*!<  ,                                                     Address offset: 0x08 */
    __IO uint32_t DIER;                   /*!<  ,                                                     Address offset: 0x0C */
    __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x10 */
    __O  uint32_t EGR;                    /*!<  ,                                                     Address offset: 0x14 */
    __IO uint32_t CCMR1;                    /*!<  ,                                                   Address offset: 0x18 */
    __IO uint32_t CCMR2;                      /*!<  ,                                                 Address offset: 0x1C */
    __IO uint32_t CCER;                   /*!<  ,                                                     Address offset: 0x20 */
    __IO uint32_t CNT;                    /*!<  ,                                                     Address offset: 0x24 */
    __IO uint32_t PSC;                    /*!<  ,                                                     Address offset: 0x28 */
    __IO uint32_t ARR;                    /*!<  ,                                                     Address offset: 0x2C */
    __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x30 */
    __IO uint32_t CCR1;                   /*!<  ,                                                     Address offset: 0x34 */
    __IO uint32_t CCR2;                   /*!<  ,                                                     Address offset: 0x38 */
    __IO uint32_t CCR3;                   /*!<  ,                                                     Address offset: 0x3C */
    __IO uint32_t CCR4;                   /*!<  ,                                                     Address offset: 0x40 */
    __IO uint32_t RSV2[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x44 */
    __IO uint32_t ECR;                    /*!<  ,                                                     Address offset: 0x54 */
    __IO uint32_t TISEL;                  /*!<  ,                                                     Address offset: 0x58 */
    __IO uint32_t AFR;                    /*!<  ,                                                     Address offset: 0x5C */
    __IO uint32_t RSV3[38];               /*!<  RESERVED REGISTER,                                    Address offset: 0x60 */
    __IO uint32_t DCR;                    /*!<  ,                                                     Address offset: 0xF8 */
    __IO uint32_t DMAR;                   /*!<  ,                                                     Address offset: 0xFC */
} GPTIM_Type;

/* ================================================================================ */
/* ================                     BSTIM16                    ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR1;                    /*!<  BSTIM16ControlRegister1,                              Address offset: 0x00 */
    __IO uint32_t CR2;                    /*!<  BSTIM16ControlRegister2,                              Address offset: 0x04 */
    __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
    __IO uint32_t IER;                    /*!<  BSTIM16InterruptEnableRegister,                       Address offset: 0x0C */
    __IO uint32_t ISR;                    /*!<  BSTIM16InterruptStatusRegister,                       Address offset: 0x10 */
    __O  uint32_t EGR;                    /*!<  BSTIM16EventGenerationRegister,                       Address offset: 0x14 */
    __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
    __IO uint32_t CNT;                    /*!<  BSTIM16CounterRegister,                               Address offset: 0x24 */
    __IO uint32_t PSC;                    /*!<  BSTIM16PrescalerRegister,                             Address offset: 0x28 */
    __IO uint32_t ARR;                    /*!<  BSTIM16Auto-ReloadRegister,                           Address offset: 0x2C */
} BSTIM16_Type;

/* ================================================================================ */
/* ================                     LPTIM16                    ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CFGR;                   /*!<  LPTIM16ConfigRegister,                                Address offset: 0x00 */
    __I  uint32_t CNT;                    /*!<  LPTIM16CounterRegister,                               Address offset: 0x04 */
    __IO uint32_t CCSR;                   /*!<  LPTIM16Capture/CompareControlandStatusRegister,       Address offset: 0x08 */
    __IO uint32_t ARR;                    /*!<  LPTIM16Auto-ReloadRegister,                           Address offset: 0x0C */
    __IO uint32_t IER;                    /*!<  LPTIM16InterruptEnableRegister,                       Address offset: 0x10 */
    __IO uint32_t ISR;                    /*!<  LPTIM16InterruptStatusRegister,                       Address offset: 0x14 */
    __IO uint32_t CR;                     /*!<  LPTIM16ControlRegister,                               Address offset: 0x18 */
    __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
    __IO uint32_t CCR1;                   /*!<  LPTIM16Capture/CompareRegister1,                      Address offset: 0x20 */
    __IO uint32_t CCR2;                   /*!<  LPTIM16Capture/CompareRegister2,                      Address offset: 0x24 */
} LPTIM16_Type;

