Changweibin/TEST/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33ld5xx.h
/* ================================================================================ */
/* ================                     TAU0                       ================ */
/* ================================================================================ */
typedef struct
{
  __IO uint32_t T0CR;                   /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t RSV0;                   /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t T0EGR;                  /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t RSV1;                   /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t T0CFGR;                 /*!<  ,                                                     Address offset: 0x10 */    
  __IO uint32_t T1CFGR;                 /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t T2CFGR;                 /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t T3CFGR;                 /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t T4CFGR;                 /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t T5CFGR;                 /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t T6CFGR;                 /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t T7CFGR;                 /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t T0MDR;                  /*!<  ,                                                     Address offset: 0x30 */
  __IO uint32_t T1MDR;                  /*!<  ,                                                     Address offset: 0x34 */
  __IO uint32_t T2MDR;                  /*!<  ,                                                     Address offset: 0x38 */
  __IO uint32_t T3MDR;                  /*!<  ,                                                     Address offset: 0x3C */
  __IO uint32_t T4MDR;                  /*!<  ,                                                     Address offset: 0x40 */
  __IO uint32_t T5MDR;                  /*!<  ,                                                     Address offset: 0x44 */
  __IO uint32_t T6MDR;                  /*!<  ,                                                     Address offset: 0x48 */
  __IO uint32_t T7MDR;                  /*!<  ,                                                     Address offset: 0x4C */
  __IO uint32_t T0ARR;                  /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t T1ARR;                  /*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t T2ARR;                  /*!<  ,                                                     Address offset: 0x58 */
  __IO uint32_t T3ARR;                  /*!<  ,                                                     Address offset: 0x5C */
  __IO uint32_t T4ARR;                  /*!<  ,                                                     Address offset: 0x60 */
  __IO uint32_t T5ARR;                  /*!<  ,                                                     Address offset: 0x64 */
  __IO uint32_t T6ARR;                  /*!<  ,                                                     Address offset: 0x68 */
  __IO uint32_t T7ARR;                  /*!<  ,                                                     Address offset: 0x6C */
  __IO uint32_t T0CCR;                  /*!<  ,                                                     Address offset: 0x70 */
  __IO uint32_t T1CCR;                  /*!<  ,                                                     Address offset: 0x74 */
  __IO uint32_t T2CCR;                  /*!<  ,                                                     Address offset: 0x78 */
  __IO uint32_t T3CCR;                  /*!<  ,                                                     Address offset: 0x7C */
  __IO uint32_t T4CCR;                  /*!<  ,                                                     Address offset: 0x80 */
  __IO uint32_t T5CCR;                  /*!<  ,                                                     Address offset: 0x84 */
  __IO uint32_t T6CCR;                  /*!<  ,                                                     Address offset: 0x88 */
  __IO uint32_t T7CCR;                  /*!<  ,                                                     Address offset: 0x8C */
  __IO uint32_t T0IER;                  /*!<  ,                                                     Address offset: 0x90 */
  __IO uint32_t T1IER;                  /*!<  ,                                                     Address offset: 0x94 */
  __IO uint32_t T2IER;                  /*!<  ,                                                     Address offset: 0x98 */
  __IO uint32_t T3IER;                  /*!<  ,                                                     Address offset: 0x9C */
  __IO uint32_t T4IER;                  /*!<  ,                                                     Address offset: 0xA0 */
  __IO uint32_t T5IER;                  /*!<  ,                                                     Address offset: 0xA4 */
  __IO uint32_t T6IER;                  /*!<  ,                                                     Address offset: 0xA8 */
  __IO uint32_t T7IER;                  /*!<  ,                                                     Address offset: 0xAC */
  __IO uint32_t T0ISR;                  /*!<  ,                                                     Address offset: 0xB0 */
  __IO uint32_t T1ISR;                  /*!<  ,                                                     Address offset: 0xB4 */
  __IO uint32_t T2ISR;                  /*!<  ,                                                     Address offset: 0xB8 */
  __IO uint32_t T3ISR;                  /*!<  ,                                                     Address offset: 0xBC */
  __IO uint32_t T4ISR;                  /*!<  ,                                                     Address offset: 0xC0 */
  __IO uint32_t T5ISR;                  /*!<  ,                                                     Address offset: 0xC4 */
  __IO uint32_t T6ISR;                  /*!<  ,                                                     Address offset: 0xC8 */
  __IO uint32_t T7ISR;                  /*!<  ,                                                     Address offset: 0xCC */
  __I  uint32_t T0CNTR;                 /*!<  ,                                                     Address offset: 0xD0 */
  __I  uint32_t T1CNTR;                 /*!<  ,                                                     Address offset: 0xD4 */
  __I  uint32_t T2CNTR;                 /*!<  ,                                                     Address offset: 0xD8 */
  __I  uint32_t T3CNTR;                 /*!<  ,                                                     Address offset: 0xDC */
  __I  uint32_t T4CNTR;                 /*!<  ,                                                     Address offset: 0xE0 */
  __I  uint32_t T5CNTR;                 /*!<  ,                                                     Address offset: 0xE4 */
  __I  uint32_t T6CNTR;                 /*!<  ,                                                     Address offset: 0xE8 */
  __I  uint32_t T7CNTR;                 /*!<  ,                                                     Address offset: 0xEC */
  __IO uint32_t RSV2[20];               /*!<  ,                                                     Address offset: 0x18 */
}TAU0_Type;

/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */


/**
  * @brief ADC module information (ADC)
  */

typedef struct {                                    /*!< ADC Structure                                     */
  __IO uint32_t  GISR;                              /*!< GISR Register,          Address offset: 0x00 */
  __IO uint32_t  GIER;                              /*!< GIER Register,          Address offset: 0x04 */
  __IO uint32_t  CR1;                               /*!< CR1 Register,           Address offset: 0x08 */
  __IO uint32_t  CR2;                               /*!< CR2 Register,           Address offset: 0x0C */
  __I  uint32_t  RESERVED;                          /*!< RESERVED REGISTER,      Address offset: 0x10 */
  __IO uint32_t  CFGR1;                             /*!< CFGR1 Register ,        Address offset: 0x14 */
  __IO uint32_t  CFGR2;                             /*!< CFGR2 Register ,        Address offset: 0x18 */
  __I  uint32_t  RESERVED1[2];                      /*!< RESERVED REGISTER,      Address offset: 0x1C */
  __IO uint32_t  OSR;                               /*!< OSR Register,           Address offset: 0x24 */
  __IO uint32_t  ACQ_SR;                            /*!< ACQ_SR Register ,       Address offset: 0x28 */
  __IO uint32_t  ACQ_SACR;                          /*!< ACQ_SACR Register,      Address offset: 0x2C */
  __IO uint32_t  HLTR;                              /*!< HLTR Register,          Address offset: 0x30 */
  __IO uint32_t  AWDCR;                             /*!< AWDCR Register,         Address offset: 0x34 */
  __IO uint32_t  ACQ_ISR;                           /*!< ACQ_ISR Register,       Address offset: 0x38 */
  __I  uint32_t  RESERVED2;                          /*!< RESERVED REGISTER,      Address offset: 0x3C */
  __IO uint32_t  ACQ_IER;                           /*!< ACQ_IER Register,       Address offset: 0x40 */
  __I  uint32_t  RESERVED3[7];                      /*!< RESERVED REGISTER,      Address offset: 0x44 */
  __IO uint32_t  DMACOMB_CR;                        /*!< GISR Register,          Address offset: 0x60 */
  __IO uint32_t  DMACOMB_DR;                        /*!< GISR Register,          Address offset: 0x64 */
  __I  uint32_t  RESERVED4[6];                      /*!< RESERVED REGISTER,      Address offset: 0x68 */
  __IO uint32_t  ACQ0_CR;                           /*!< ACQ0_CR Register,       Address offset: 0x80 */
  __IO uint32_t  ACQ1_CR;                           /*!< ACQ1_CR Register,       Address offset: 0x84 */
  __IO uint32_t  ACQ2_CR;                           /*!< ACQ2_CR Register,       Address offset: 0x88 */
  __IO uint32_t  ACQ3_CR;                           /*!< ACQ3_CR Register,       Address offset: 0x8C */
  __IO uint32_t  ACQ4_CR;                           /*!< ACQ4_CR Register,       Address offset: 0x90 */
  __I  uint32_t  RESERVED5[11];                     /*!< RESERVED REGISTER,      Address offset: 0x94 */
  __IO uint32_t  ACQ0_DR;                           /*!< ACQ0_DR Register,       Address offset: 0xC0 */
  __IO uint32_t  ACQ1_DR;                           /*!< ACQ1_DR Register,       Address offset: 0xC4 */
  __IO uint32_t  ACQ2_DR;                           /*!< ACQ2_DR Register,       Address offset: 0xC8 */
  __IO uint32_t  ACQ3_DR;                           /*!< ACQ3_DR Register,       Address offset: 0xCC */
  __IO uint32_t  ACQ4_DR;                           /*!< ACQ4_DR Register,       Address offset: 0xD0 */
  __I  uint32_t  RESERVED6[201];                    /*!< RESERVED REGISTER,      Address offset: 0xD4 */
  __IO uint32_t  DBG_DR;                            /*!< ACQ0_DR Register,       Address offset: 0x3F8 */
  __IO uint32_t  DBG_CR;                            /*!< ACQ0_DR Register,       Address offset: 0x3FC */
} ADC_Type;

/* ================================================================================ */
/* ================                      DACx                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR1;                    /*!<  DACxControlRegister,                                  Address offset: 0x00 */
    __IO uint32_t CR2;                    /*!<  DACxControlRegister,                                  Address offset: 0x04 */
    __IO uint32_t CFGR;                   /*!<  DACxConfigRegister,                                   Address offset: 0x08 */
    __O  uint32_t SWTRGR;                 /*!<  DACxSoftwareTriggerRegister,                          Address offset: 0x0C */
    __IO uint32_t DHR;                    /*!<  DACxDataHoldingRegister,                              Address offset: 0x10 */
    __IO uint32_t ISR;                    /*!<  DACxInterruptStatusRegister,                          Address offset: 0x14 */
    __IO uint32_t IER;                    /*!<  DACxInterruptEnableRegister,                          Address offset: 0x18 */
    __IO uint32_t SHTR;                   /*!<  DACxSampleHoldTimeRegister,                           Address offset: 0x1C */
} DAC_Type;

/* ================================================================================ */
/* ================                       PGL                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR;                     /*!<  ,                                                     Address offset: 0x00 */
    __IO uint32_t CFGR0;                  /*!<  ,                                                     Address offset: 0x04 */
    __IO uint32_t CFGR1;                  /*!<  ,                                                     Address offset: 0x08 */
    __IO uint32_t CFGR2;                  /*!<  ,                                                     Address offset: 0x0C */
    __IO uint32_t CFGR3;                  /*!<  ,                                                     Address offset: 0x10 */
    __IO uint32_t IER;                    /*!<  ,                                                     Address offset: 0x14 */
    __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x18 */
    __IO uint32_t LUT0;                   /*!<  ,                                                     Address offset: 0x1C */
    __IO uint32_t LUT1;                   /*!<  ,                                                     Address offset: 0x20 */
    __IO uint32_t LUT2;                   /*!<  ,                                                     Address offset: 0x24 */
    __IO uint32_t LUT3;                   /*!<  ,                                                     Address offset: 0x28 */
} PGL_Type;

/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t EXTIEDSA;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x00 */
    __IO uint32_t EXTIEDSB;               /*!<  ExternalInterruptInputSelectRegister1,                Address offset: 0x04 */
    __IO uint32_t EXTIEDSC;               /*!<  ExternalInterruptEdgeSelectandEnableRegister0,        Address offset: 0x08 */
    __IO uint32_t EXTIEDSD;               /*!<  ExternalInterruptEdgeSelectandEnableRegister1,        Address offset: 0x0C */
    __IO uint32_t EXTIEDSE;               /*!<  ExternalInterruptDigitalFilterRegister,               Address offset: 0x10 */
    __IO uint32_t EXTIEDSF;               /*!<  ExternalInterruptandStatusRegister,                   Address offset: 0x14 */
    __IO uint32_t EXTIEDSG;               /*!<  ExternalInterruptDataInputRegister,                   Address offset: 0x18 */
    __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  	__IO uint32_t EXTIDFAB;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x24 */
 	  __IO uint32_t EXTIDFCD;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x28 */
	  __IO uint32_t EXTIDFEF;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x2C */
	  __IO uint32_t EXTIDFGH;                /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x30 */
  	__IO uint32_t RSV2[1];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  	__IO uint32_t EXTIISRAB;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x38 */
  	__IO uint32_t EXTIISRCD;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x3C */
  	__IO uint32_t EXTIISREF;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x40 */
  	__IO uint32_t EXTIISRGH;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x44 */
  	__IO uint32_t RSV3[1];                /*!<  RESERVED REGISTER,                                    Address offset: 0x48 */
  	__IO uint32_t EXTIDIAB;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x4C */
   	__IO uint32_t EXTIDICD;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x50 */
	  __IO uint32_t EXTIDIEF;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x54 */
	  __IO uint32_t EXTIDIGH;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x58 */
	  __IO uint32_t RSV4[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x5C */
    __IO uint32_t FOUTSEL;                /*!<  FrequencyOutputSelectRegister,                        Address offset: 0x60 */
    __IO uint32_t RSV5[22];               /*!<  RESERVED REGISTER,                                    Address offset: 0x64 */
    __IO uint32_t PINWKEN;                /*!<  WakeupEnableRegister,                                 Address offset: 0xBC */
} GPIO_COMMON_Type;

typedef struct
{
    __IO uint32_t INEN;                   /*!<  GPIOxInputEnableRegister,                             Address offset: 0x00 */
    __IO uint32_t PUDEN;                  /*!<  GPIOxPull-UpPull-DownEnableRegister,                  Address offset: 0x04 */
    __IO uint32_t ODEN;                   /*!<  GPIOxOpen-DrainEnableRegister,                        Address offset: 0x08 */
    __IO uint32_t FCR;                    /*!<  GPIOxFunctionControlRegister,                         Address offset: 0x0C */
    __IO uint32_t DO;                     /*!<  GPIOxDataOutputRegister,                              Address offset: 0x10 */
    __O  uint32_t DSET;                   /*!<  GPIOxDataSetRegister,                                 Address offset: 0x14 */
    __O  uint32_t DRST;                   /*!<  GPIOxDataResetRegister,                               Address offset: 0x18 */
    __I  uint32_t DIN;                    /*!<  GPIOxDataInputRegister,                               Address offset: 0x1C */
    __IO uint32_t DFS;                    /*!<  GPIOxDigitalFunctionSelect,                           Address offset: 0x20 */
    __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
    __IO uint32_t DSR;                    /*!<  GPIOxAnalogchannelEnableRegister,                     Address offset: 0x30 */ 
    __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */	
} GPIO_Type;

/* ================================================================================ */
/* ================                       SFU                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t RSV1[2];                 /*!< , Address offset: 0x00 */
	__IO uint32_t MAP_CR;                  /*!< , Address offset: 0x08 */
    __IO uint32_t MAP_SR;                  /*!< , Address offset: 0x0C */
} SFU_Type;

/* ================================================================================ */
/* ================                      QSPI                      ================ */
/* ================================================================================ */

typedef struct
{
    __IO uint32_t CR;                      /*!<  , Address offset: 0x00 */
	__IO uint32_t CFGR;                    /*!<  , Address offset: 0x04 */
    __IO uint32_t SR;                      /*!<  , Address offset: 0x08 */
    __IO uint32_t DATALEN;                 /*!<  , Address offset: 0x0C */
    __IO uint32_t CCR;                     /*!<  , Address offset: 0x10 */
    __IO uint32_t ADDR;                    /*!<  , Address offset: 0x14 */
    __IO uint32_t ABR;                     /*!<  , Address offset: 0x18 */
    __IO uint32_t DATA;                    /*!<  , Address offset: 0x1C */
    __IO uint32_t SMSK;                    /*!<  , Address offset: 0x20 */
    __IO uint32_t SMAT;                    /*!<  , Address offset: 0x24 */
    __IO uint32_t PITV;                    /*!<  , Address offset: 0x28 */
	__IO uint32_t TOR;                     /*!<  , Address offset: 0x2C */
} QSPI_Type;

/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */

