Changweibin/TEST/Drivers/CMSIS/Device/FM/FM33xx/Include/fm33ld5xx.h
typedef struct
{
    __I  uint32_t SYSCFG;                 /*!<  ,                                                     Address offset: 0x00 */
    __I  uint32_t USRCFG;                 /*!<  ,                                                     Address offset: 0x04 */
    __IO uint32_t DBGCFG;                 /*!<  ,                                                     Address offset: 0x08 */
    __IO uint32_t RAMCFG;                 /*!<  ,                                                     Address offset: 0x0C */
    __IO uint32_t FLS_ACLOCK1;            /*!<  ,                                                     Address offset: 0x10 */
    __IO uint32_t FLS_ACLOCK2;            /*!<  ,                                                     Address offset: 0x14 */
    __I  uint32_t RAMRP00;                /*!<  ,                                                     Address offset: 0x18 */
    __I  uint32_t RAMRP01;                /*!<  ,                                                     Address offset: 0x1C */
    __I  uint32_t RAMRP10;                /*!<  ,                                                     Address offset: 0x20 */
    __I  uint32_t RAMRP11;                /*!<  ,                                                     Address offset: 0x24 */
    __I  uint32_t RAMRP20;                /*!<  ,                                                     Address offset: 0x2C */
    __I  uint32_t RAMRP21;                /*!<  ,                                                     Address offset: 0x30 */
	  __I  uint32_t RAMRP30;                /*!<  ,                                                     Address offset: 0x34 */
    __I  uint32_t RAMRP31;                /*!<  ,                                                     Address offset: 0x38 */
    __I  uint32_t FLS_RED;                /*!<  ,                                                     Address offset: 0x3C */
    __IO uint32_t RSV1[5];                /*!<  RESERVED REGISTER,                                    Address offset: 0x40 */
    __I  uint32_t FLS_TSTEN;              /*!<  ,                                                     Address offset: 0x50 */
    __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
    __I  uint32_t SCU_VRSR;               /*!<  ,                                                     Address offset: 0x60 */
} SCU_Type;



/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
#pragma pop
#elif defined(__ICCARM__)
/* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
#pragma warning restore
#else
#warning Not supported compiler type
#endif

/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */

/* Peripheral and SRAM base address */

#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)

/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/* Peripheral memory map */
#define SCU_BASE                        (PERIPH_BASE        +0x00000000)
#define DMA_BASE                        (PERIPH_BASE        +0x00000400)
#define GPIOA_BASE                      (PERIPH_BASE        +0x00000C00)
#define GPIOB_BASE                      (PERIPH_BASE        +0x00000C40)
#define GPIOC_BASE                      (PERIPH_BASE        +0x00000C80)
#define GPIOD_BASE                      (PERIPH_BASE        +0x00000CC0)
#define GPIOE_BASE                      (PERIPH_BASE        +0x00000D00)
#define GPIOF_BASE                      (PERIPH_BASE        +0x00000D40)
#define GPIOG_BASE                      (PERIPH_BASE        +0x00000D80)
#define GPIO_COMMON_BASE                (PERIPH_BASE        +0x00000E40)
#define FLS_BASE                        (PERIPH_BASE        +0x00001000)
#define QSPI_BASE                       (PERIPH_BASE        +0x00001400)
#define PMU_BASE                        (PERIPH_BASE        +0x00002000)
#define CMU_BASE                        (PERIPH_BASE        +0x00002400)
#define RMU_BASE                        (PERIPH_BASE        +0x00002800)
#define SFU_BASE                        (PERIPH_BASE        +0x00002C00)
#define RAMBIST_BASE                    (PERIPH_BASE        +0x0000FC00)
#define SPI0_BASE                       (PERIPH_BASE        +0x00019000)
#define SPI1_BASE                       (PERIPH_BASE        +0x00018C00)
#define SPI2_BASE                       (PERIPH_BASE        +0x00010800)
#define IWDT_BASE                       (PERIPH_BASE        +0x00011400)
#define WWDT_BASE                       (PERIPH_BASE        +0x00011800)
#define UART0_BASE                      (PERIPH_BASE        +0x00011C00)
#define UART1_BASE                      (PERIPH_BASE        +0x00012000)
#define UART2_BASE                      (PERIPH_BASE        +0x00017400)
#define UART3_BASE                      (PERIPH_BASE        +0x00017800)
#define UART4_BASE                      (PERIPH_BASE        +0x00016800)
#define UART5_BASE                      (PERIPH_BASE        +0x00016C00)
#define UART_COMMON_BASE                (PERIPH_BASE        +0x00017C00)
#define I2C0_BASE                       (PERIPH_BASE        +0x00012400)
#define I2C1_BASE                       (PERIPH_BASE        +0x00012800)
#define SVD_BASE                        (PERIPH_BASE        +0x00012C00)
#define LPTIM16_BASE                    (PERIPH_BASE        +0x00013400)
#define GPTIM0_BASE                     (PERIPH_BASE        +0x00013800)
#define GPTIM1_BASE                     (PERIPH_BASE        +0x00013C00)
#define GPTIM5_BASE                     (PERIPH_BASE        +0x00014000)
#define TAU0_BASE                       (PERIPH_BASE        +0x00014400)
#define CLM0_BASE                       (PERIPH_BASE        +0x00015000)
#define CLM1_BASE                       (PERIPH_BASE        +0x00015400)
#define CLM2_BASE                       (PERIPH_BASE        +0x00015800)
#define CRC_BASE                        (PERIPH_BASE        +0x00018000)
#define ATIM0_BASE                      (PERIPH_BASE        +0x00018400)
#define ATIM1_BASE                      (PERIPH_BASE        +0x0001B000) 
#define ATIM2_BASE                      (PERIPH_BASE        +0x00018800) 
#define DAC0_BASE                       (PERIPH_BASE        +0x0001A800)
#define DAC1_BASE                       (PERIPH_BASE        +0x0001A400)
#define ADC0_BASE                       (PERIPH_BASE        +0x0001AC00)
#define ADC1_BASE                       (PERIPH_BASE        +0x0001B800)
#define ADC2_BASE                       (PERIPH_BASE        +0x0001BC00)
#define ADC3_BASE                       (PERIPH_BASE        +0x0001E000)
#define BSTIM16_BASE                    (PERIPH_BASE        +0x0001B400)
#define PGL_BASE                        (PERIPH_BASE        +0x0001DC00)
#define CORDIC_BASE                     (PERIPH_BASE        +0x0001EC00)
#define COMP0_BASE                      (PERIPH_BASE        +0x0001F000)
#define COMP1_BASE                      (PERIPH_BASE        +0x0001F004)
#define COMP2_BASE                      (PERIPH_BASE        +0x0001F008)
#define COMP3_BASE                      (PERIPH_BASE        +0x0001F00C)
#define COMP_COMMON_BASE                (PERIPH_BASE        +0x0001F010)
#define CANFD0_BASE                     (PERIPH_BASE        +0x00028000)
#define CANFD0_RX_FIFO_BASE             (CANFD0_BASE        +0x00000520)
#define CANFD0_COMMON_FIFO_BASE         (CANFD0_BASE        +0x000005B8)
#define CANFD0_TX_MESSAGE_BASE          (CANFD0_BASE        +0x00000604)
#define CANFD0_TX_HISTORY_LIST_BASE     (CANFD0_BASE        +0x00000740)
#define CANFD0_RX_MESSAGE0_BASE         (CANFD0_BASE        +0x00000920)
#define CANFD0_RX_MESSAGE1_BASE         (CANFD0_BASE        +0x00000D20)
#define CANFD0_RX_MESSAGE2_BASE         (CANFD0_BASE        +0x00001120)
#define CANFD0_RX_MESSAGE3_BASE         (CANFD0_BASE        +0x00001520)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */
#define ADC0                             ((ADC_Type          *) ADC0_BASE        )
#define ADC1                             ((ADC_Type          *) ADC1_BASE        )
#define ADC2                             ((ADC_Type          *) ADC2_BASE        )
#define ADC3                             ((ADC_Type          *) ADC3_BASE        )
#define ATIM0                            ((ATIM_Type         *) ATIM0_BASE       )
#define ATIM1                            ((ATIM_Type         *) ATIM1_BASE       )
#define ATIM2                            ((ATIM_Type         *) ATIM2_BASE       )
#define BSTIM16                          ((BSTIM16_Type      *) BSTIM16_BASE     )
#define CANFD0                           ((CANFD_COMMON_Type *) CANFD0_BASE      )
#define CANFD0_RX_FIFO                   ((CANFD_RX_FIFO_Type         *) CANFD0_RX_FIFO_BASE         )
#define CANFD0_COMMON_FIFO               ((CANFD_COMMON_FIFO_Type     *) CANFD0_COMMON_FIFO_BASE     )
#define CANFD0_TX_MESSAGE                ((CANFD_TX_MESSAGE_Type      *) CANFD0_TX_MESSAGE_BASE      )
#define CANFD0_TX_HISTORY_LIST           ((CANFD_TX_HISTORY_LIST_Type *) CANFD0_TX_HISTORY_LIST_BASE )
#define CANFD0_RX_MESSAGE0               ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE0_BASE     )
#define CANFD0_RX_MESSAGE1               ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE1_BASE     )
#define CANFD0_RX_MESSAGE2               ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE2_BASE     )
#define CANFD0_RX_MESSAGE3               ((CANFD_RX_MESSAGE_Type      *) CANFD0_RX_MESSAGE3_BASE     )
#define CLM0                             ((CLM_Type          *) CLM0_BASE        )
#define CLM1                             ((CLM_Type          *) CLM1_BASE        )
#define CLM2                             ((CLM_Type          *) CLM2_BASE        )
#define CMU                              ((CMU_Type          *) CMU_BASE         )
#define COMP0                            ((COMP_Type         *) COMP0_BASE       )
#define COMP1                            ((COMP_Type         *) COMP1_BASE       )
#define COMP2                            ((COMP_Type         *) COMP2_BASE       )
#define COMP3                            ((COMP_Type         *) COMP3_BASE       )
#define COMP                             ((COMP_COMMON_Type  *) COMP_COMMON_BASE )
#define CORDIC                           ((CORDIC_Type       *) CORDIC_BASE      )
#define CRC                              ((CRC_Type          *) CRC_BASE         )
#define DAC0                             ((DAC_Type          *) DAC0_BASE        )
#define DAC1                             ((DAC_Type          *) DAC1_BASE        )
#define DMA                              ((DMA_Type          *) DMA_BASE         )
#define FLASH                            ((FLASH_Type        *) FLS_BASE         )
#define GPIOA                            ((GPIO_Type         *) GPIOA_BASE       )
#define GPIOB                            ((GPIO_Type         *) GPIOB_BASE       )
#define GPIOC                            ((GPIO_Type         *) GPIOC_BASE       )
#define GPIOD                            ((GPIO_Type         *) GPIOD_BASE       )
#define GPIOE                            ((GPIO_Type         *) GPIOE_BASE       )
#define GPIOF                            ((GPIO_Type         *) GPIOF_BASE       )
#define GPIOG                            ((GPIO_Type         *) GPIOG_BASE       )
#define GPIO                             ((GPIO_COMMON_Type  *) GPIO_COMMON_BASE )
#define GPTIM0                           ((GPTIM_Type        *) GPTIM0_BASE      )
#define GPTIM1                           ((GPTIM_Type        *) GPTIM1_BASE      )
#define GPTIM5                           ((GPTIM_Type        *) GPTIM5_BASE      )
#define I2C0                             ((I2C_Type          *) I2C0_BASE        )
#define I2C1                             ((I2C_Type          *) I2C1_BASE        )
#define IWDT                             ((IWDT_Type         *) IWDT_BASE        )
#define LPTIM16                          ((LPTIM16_Type      *) LPTIM16_BASE     )
#define PGL                              ((PGL_Type          *) PGL_BASE         )
#define PMU                              ((PMU_Type          *) PMU_BASE         )
#define QSPI                             ((QSPI_Type         *) QSPI_BASE        )	
#define RAMBIST                          ((RAMBIST_Type      *) RAMBIST_BASE     )
#define RMU                              ((RMU_Type          *) RMU_BASE         )
#define SPI0                             ((SPI_Type          *) SPI0_BASE        )
#define SPI1                             ((SPI_Type          *) SPI1_BASE        )
#define SPI2                             ((SPI_Type          *) SPI2_BASE        )
#define TAU0                             ((TAU0_Type         *) TAU0_BASE      )
#define SVD                              ((SVD_Type          *) SVD_BASE         )
#define UART                             ((UART_COMMON_Type  *) UART_COMMON_BASE )
#define UART0                            ((UART_Type         *) UART0_BASE       )
#define UART1                            ((UART_Type         *) UART1_BASE       )
#define UART2                            ((UART_Type         *) UART2_BASE       )
#define UART3                            ((UART_Type         *) UART3_BASE       )
#define UART4                            ((UART_Type         *) UART4_BASE       )
#define UART5                            ((UART_Type         *) UART5_BASE       )
#define SCU                              ((SCU_Type          *) SCU_BASE         )
#define SFU                              ((SFU_Type          *) SFU_BASE         )
#define WWDT                             ((WWDT_Type         *) WWDT_BASE        )


/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33LD5XX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33LD5XX_H */
